{"name": "Pronoun", "submissionType": null, "githubLink": "https://github.com/navgurukul/newton/tree/master/Grammar-101/pronoun.md", "solution": null, "reviewType": "peer", "id": 1845, "content": "The word that is used in place of nouns is called Pronoun. ( Noun के बदले आए हुए शब्द को pronoun कहते है। )\n\n\nLets take an example and see the difference. Take a look below to sentences:\n1) Rahul is absent because Rahul is ill. (राहुल अनुपस्थित है क्योंकि राहुल बीमार है। )\n2) Rahul is absent because he is ill. (राहुल अनुपस्थित है क्योंकि वह बीमार है। )\n\n\nIn the first sentence, proper noun 'Rahul' has been repeatedly used, whereas the use of *he* (pronoun) in the second sentence looks better in comparison to first sentence.\n\n(पहले वाक्य मे बार-बार  राहुल उपयोग हो रहा है, दूसरे वाक्य मे राहुल की जगह पर *\"वह\"* उपयोग हो रहा है। )\n\n**Excercise:**\n\n1. Replace the word in bracket with suitable pronouns.\n\n1. (Sonam) is the the new Training and Placement Coordinator.\n2. Khushboo, Pooja and Swati are in the kitchen today. (Khushboo, Pooja and Swati) will make gulab jamun.\n3. NavGurukul boys stay in Dharamsala. NavGurukul boys like to code.\n4. In Indian families, people don't talk about periods. (People) think periods are tabboo.\n5. Mary Kom has won six world championship and (Mary Kom) is the first boxer to have won this.\n6. I want to discuss about the code with Rahul. Please go and call (Rahul).\n\n\n2. Following is the list of most common pronouns. Find their meaning and make 20 sentences using different pronouns. Write your sentences in the comments.\n\nI, you, he, she, it, we, they, me, him, her, us, them, this, that, these, those, who, whom, which, what,myself,yourself, himself, herself, itself\n\n\nPractice the following exercises:\n[Exercise 1](https://www.myenglishpages.com/site_php_files/grammar-exercise-object-pronouns.php)\n[Exercise 2](https://www.myenglishpages.com/site_php_files/grammar-exercise-personal-pronouns.php)\n", "sequenceNum": 2000, "parentExerciseId": null, "slug": "Grammar-101__pronoun"}