{"name": "Reading Strategies", "submissionType": null, "githubLink": "https://github.com/navgurukul/newton/tree/master/english-501/Reading_Strategies.md", "solution": null, "reviewType": "peer", "id": 2048, "content": "```ngMeta\nname: Reading Strategies\n```\n### Strategies to Read and Comprehend\n1. **Make a vocabulary list before you begin.**\nIn the excerpt above, you might have noticed some words you don’t know. Some words are more important to understand than others (we’ll learn more about that in the second tip). Before you read a text, skim it for words you don’t know and make a list with definitions.\n\nLook for:\n\n* Words that are repeated more than once.\n* Unknown words in short sentences.\n* Words you’ve seen in other places.\n\nFor example, the end of the last sentence in the first paragraph talks about the “neural circuits inside our brains.” What are neural circuits? By looking at the rest of the sentence, you can tell that neural circuits are something we have inside our brains.\n\nIf you made a list of vocabulary words before starting to read, you might already know that a circuit is a closed route that electricity takes. So you might guess that a neural circuit is the path that signals in our brains take when we think, act or learn something. And you’d be right!\n\n2. **Read and summarize.**\nYou understand the words. You understand the sentences. You’re even beginning to understand the ideas. Now stop! Read the text again and try to summarize it. Describe the main points and ideas using your own words.\n\nAfter going through the text little by little using these seven tips, you should be able to understand it a lot better than when you read it for the first time. Here’s a summary of the text, using simpler words:\n\nReading is not something we do naturally, so our brains need to learn how to change the letters on a page into actual meaning. How and where we read can change the way our brains make this change.\n\nStudies have shown that our brains work in very different ways when we read an alphabetical text than when we read a text of ideograms (like Chinese characters). This probably means that our brains also work differently when we read text online than when we read text from a physical book.\n\nIn other words, you might be changing the way your brain works right now, just by reading these words on a screen instead of a printed page. Pretty crazy!\n\n3. **Skim and scan.**\n\nScanning a text means looking for a specific part or for the answer to a specific question. Skimming a text means letting your eyes look over the text quickly without really reading every word. These are both excellent strategies to use before you start reading. you will let you understand a little bit about the text or topic so you have a rough idea of what you’re going to read about.\n\n<!--4. **Drawing Inferences**\nYou can generate information that is important to constructing meaning but that is missing from, or not explicitly stated in, the text.\n\nYou can look for key words that will help in understanding the text, demonstrating how you can draw inferences from these words. \n\n5. **Asking Questions**\nBy generating questions, you become aware of whether you can answer the questions and if you understand what you are reading. You learn to ask yourself questions that require you to combine information from different segments of text. For example, you can be taught to ask main idea questions that relate to important information in a text.>\n\n\n\n\n\n\n\n\n\n", "sequenceNum": 2000, "parentExerciseId": null, "slug": "english-501__Reading_Strategies"}